zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT1180/MIMXRT1185/MIMXRT1185_cm33_COMMON.h
/* USDHC - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral USDHC2 base address */
  #define USDHC2_BASE                              (0x52860000u)
  /** Peripheral USDHC2 base address */
  #define USDHC2_BASE_NS                           (0x42860000u)
  /** Peripheral USDHC2 base pointer */
  #define USDHC2                                   ((USDHC_Type *)USDHC2_BASE)
  /** Peripheral USDHC2 base pointer */
  #define USDHC2_NS                                ((USDHC_Type *)USDHC2_BASE_NS)
  /** Array initializer of USDHC peripheral base addresses */
  #define USDHC_BASE_ADDRS                         { 0u, 0u, USDHC2_BASE }
  /** Array initializer of USDHC peripheral base pointers */
  #define USDHC_BASE_PTRS                          { (USDHC_Type *)0u, (USDHC_Type *)0u, USDHC2 }
  /** Array initializer of USDHC peripheral base addresses */
  #define USDHC_BASE_ADDRS_NS                      { 0u, 0u, USDHC2_BASE_NS }
  /** Array initializer of USDHC peripheral base pointers */
  #define USDHC_BASE_PTRS_NS                       { (USDHC_Type *)0u, (USDHC_Type *)0u, USDHC2_NS }
#else
  /** Peripheral USDHC2 base address */
  #define USDHC2_BASE                              (0x42860000u)
  /** Peripheral USDHC2 base pointer */
  #define USDHC2                                   ((USDHC_Type *)USDHC2_BASE)
  /** Array initializer of USDHC peripheral base addresses */
  #define USDHC_BASE_ADDRS                         { 0u, 0u, USDHC2_BASE }
  /** Array initializer of USDHC peripheral base pointers */
  #define USDHC_BASE_PTRS                          { (USDHC_Type *)0u, (USDHC_Type *)0u, USDHC2 }
#endif
/** Interrupt vectors for the USDHC peripheral type */
#define USDHC_IRQS                               { NotAvail_IRQn, NotAvail_IRQn, USDHC2_IRQn }

/* VMBANDGAP - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral VMBANDGAP base address */
  #define VMBANDGAP_BASE                           (0x54484780u)
  /** Peripheral VMBANDGAP base address */
  #define VMBANDGAP_BASE_NS                        (0x44484780u)
  /** Peripheral VMBANDGAP base pointer */
  #define VMBANDGAP                                ((VMBANDGAP_Type *)VMBANDGAP_BASE)
  /** Peripheral VMBANDGAP base pointer */
  #define VMBANDGAP_NS                             ((VMBANDGAP_Type *)VMBANDGAP_BASE_NS)
  /** Array initializer of VMBANDGAP peripheral base addresses */
  #define VMBANDGAP_BASE_ADDRS                     { VMBANDGAP_BASE }
  /** Array initializer of VMBANDGAP peripheral base pointers */
  #define VMBANDGAP_BASE_PTRS                      { VMBANDGAP }
  /** Array initializer of VMBANDGAP peripheral base addresses */
  #define VMBANDGAP_BASE_ADDRS_NS                  { VMBANDGAP_BASE_NS }
  /** Array initializer of VMBANDGAP peripheral base pointers */
  #define VMBANDGAP_BASE_PTRS_NS                   { VMBANDGAP_NS }
#else
  /** Peripheral VMBANDGAP base address */
  #define VMBANDGAP_BASE                           (0x44484780u)
  /** Peripheral VMBANDGAP base pointer */
  #define VMBANDGAP                                ((VMBANDGAP_Type *)VMBANDGAP_BASE)
  /** Array initializer of VMBANDGAP peripheral base addresses */
  #define VMBANDGAP_BASE_ADDRS                     { VMBANDGAP_BASE }
  /** Array initializer of VMBANDGAP peripheral base pointers */
  #define VMBANDGAP_BASE_PTRS                      { VMBANDGAP }
#endif

/* VREF - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral VREF base address */
  #define VREF_BASE                                (0x52E30000u)
  /** Peripheral VREF base address */
  #define VREF_BASE_NS                             (0x42E30000u)
  /** Peripheral VREF base pointer */
  #define VREF                                     ((VREF_Type *)VREF_BASE)
  /** Peripheral VREF base pointer */
  #define VREF_NS                                  ((VREF_Type *)VREF_BASE_NS)
  /** Array initializer of VREF peripheral base addresses */
  #define VREF_BASE_ADDRS                          { VREF_BASE }
  /** Array initializer of VREF peripheral base pointers */
  #define VREF_BASE_PTRS                           { VREF }
  /** Array initializer of VREF peripheral base addresses */
  #define VREF_BASE_ADDRS_NS                       { VREF_BASE_NS }
  /** Array initializer of VREF peripheral base pointers */
  #define VREF_BASE_PTRS_NS                        { VREF_NS }
#else
  /** Peripheral VREF base address */
  #define VREF_BASE                                (0x42E30000u)
  /** Peripheral VREF base pointer */
  #define VREF                                     ((VREF_Type *)VREF_BASE)
  /** Array initializer of VREF peripheral base addresses */
  #define VREF_BASE_ADDRS                          { VREF_BASE }
  /** Array initializer of VREF peripheral base pointers */
  #define VREF_BASE_PTRS                           { VREF }
#endif

/* XBAR_NUM_OUT221 - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral XBAR1 base address */
  #define XBAR1_BASE                               (0x52750000u)
  /** Peripheral XBAR1 base address */
  #define XBAR1_BASE_NS                            (0x42750000u)
  /** Peripheral XBAR1 base pointer */
  #define XBAR1                                    ((XBAR_NUM_OUT221_Type *)XBAR1_BASE)
  /** Peripheral XBAR1 base pointer */
  #define XBAR1_NS                                 ((XBAR_NUM_OUT221_Type *)XBAR1_BASE_NS)
  /** Array initializer of XBAR_NUM_OUT221 peripheral base addresses */
  #define XBAR_NUM_OUT221_BASE_ADDRS               { XBAR1_BASE }
  /** Array initializer of XBAR_NUM_OUT221 peripheral base pointers */
  #define XBAR_NUM_OUT221_BASE_PTRS                { XBAR1 }
  /** Array initializer of XBAR_NUM_OUT221 peripheral base addresses */
  #define XBAR_NUM_OUT221_BASE_ADDRS_NS            { XBAR1_BASE_NS }
  /** Array initializer of XBAR_NUM_OUT221 peripheral base pointers */
  #define XBAR_NUM_OUT221_BASE_PTRS_NS             { XBAR1_NS }
#else
  /** Peripheral XBAR1 base address */
  #define XBAR1_BASE                               (0x42750000u)
  /** Peripheral XBAR1 base pointer */
  #define XBAR1                                    ((XBAR_NUM_OUT221_Type *)XBAR1_BASE)
  /** Array initializer of XBAR_NUM_OUT221 peripheral base addresses */
  #define XBAR_NUM_OUT221_BASE_ADDRS               { XBAR1_BASE }
  /** Array initializer of XBAR_NUM_OUT221 peripheral base pointers */
  #define XBAR_NUM_OUT221_BASE_PTRS                { XBAR1 }
#endif

